<?php
require_once __DIR__ . '/vendor/autoload.php';

use Overtrue\Pinyin\Pinyin;

$lang['cn'] = ["86" => "中国", "1" => "加拿大", "7" => "哈萨克斯坦", "20" => "埃及", "27" => "南非", "30" => "希腊", "31" => "荷兰", "32" => "比利时", "33" => "法国", "34" => "西班牙", "36" => "匈牙利", "39" => "意大利", "40" => "罗马尼亚", "41" => "瑞士", "43" => "奥地利", "44" => "英国", "45" => "丹麦", "46" => "瑞典", "47" => "挪威", "48" => "波兰", "49" => "德国", "51" => "秘鲁", "52" => "墨西哥", "53" => "古巴", "54" => "阿根廷", "55" => "巴西", "56" => "智利", "57" => "哥伦比亚", "58" => "委内瑞拉", "60" => "马来西亚", "61" => "澳大利亚", "62" => "印度尼西亚", "63" => "菲律宾", "64" => "新西兰", "65" => "新加坡", "66" => "泰国", "81" => "日本", "82" => "韩国", "84" => "越南", "90" => "土耳其", "91" => "印度", "92" => "巴基斯坦", "93" => "阿富汗", "94" => "斯里兰卡", "95" => "缅甸", "98" => "伊朗", "211" => "南苏丹", "212" => "摩洛哥", "213" => "阿尔及利亚", "216" => "突尼斯", "218" => "利比亚", "220" => "冈比亚", "221" => "塞内加尔", "222" => "毛里塔尼亚", "223" => "马里", "225" => "科特迪瓦", "226" => "布基纳法索", "227" => "尼日尔", "228" => "多哥", "229" => "贝宁", "230" => "毛里求斯", "231" => "利比里亚", "232" => "塞拉利昂", "233" => "加纳", "234" => "尼日利亚", "235" => "乍得", "236" => "中非", "237" => "喀麦隆", "238" => "佛得角", "240" => "赤道几内亚", "241" => "加蓬", "242" => "刚果", "243" => "扎伊尔", "244" => "安哥拉", "245" => "几内亚比绍", "248" => "塞舌尔", "249" => "苏丹", "250" => "卢旺达", "251" => "埃塞俄比亚", "252" => "索马里", "253" => "吉布提", "254" => "肯尼亚", "255" => "坦桑尼亚", "256" => "乌干达", "257" => "布隆迪", "258" => "莫桑比克", "260" => "赞比亚", "261" => "马达加斯加", "262" => "留尼汪岛", "263" => "津巴布韦", "264" => "纳米比亚", "265" => "马拉维", "266" => "莱索托", "267" => "博茨瓦纳", "268" => "斯威士兰", "269" => "科摩罗", "291" => "厄立特里亚", "297" => "阿鲁巴岛", "298" => "法罗群岛(丹)", "299" => "格陵兰岛", "350" => "直布罗陀(英)", "351" => "葡萄牙", "352" => "卢森堡", "353" => "爱尔兰", "354" => "冰岛", "355" => "阿尔巴尼亚", "356" => "马耳他", "357" => "塞浦路斯", "358" => "芬兰", "359" => "保加利亚", "370" => "立陶宛", "371" => "拉脱维亚", "372" => "爱沙尼亚", "373" => "摩尔多瓦", "374" => "亚美尼亚", "375" => "白俄罗斯", "376" => "安道尔", "377" => "摩纳哥", "378" => "圣马力诺", "380" => "乌克兰", "381" => "南斯拉夫", "382" => "黑山", "385" => "克罗地亚", "386" => "斯洛文尼亚", "387" => "波斯尼亚和黑塞哥维那", "389" => "马其顿", "420" => "捷克", "421" => "斯洛伐克", "423" => "列支敦士登的", "500" => "福克兰群岛", "501" => "伯利兹", "502" => "危地马拉", "503" => "萨尔瓦多", "504" => "洪都拉斯", "505" => "尼加拉瓜", "506" => "哥斯达黎加", "507" => "巴拿马", "509" => "海地", "590" => "瓜德罗普岛(法)", "591" => "玻利维亚", "592" => "圭亚那", "593" => "厄瓜多尔", "594" => "法属圭亚那", "595" => "巴拉圭", "596" => "马提尼克(法)", "597" => "苏里南", "598" => "乌拉圭", "599" => "荷属安的列斯群岛", "670" => "马里亚纳群岛", "671" => "关岛(美)", "673" => "文莱", "674" => "瑙鲁", "675" => "巴布亚新几内亚", "676" => "汤加", "677" => "所罗门群岛", "678" => "瓦努阿图", "679" => "斐济", "680" => "帕劳(美)", "682" => "科克群岛(新)", "683" => "纽埃岛(新)", "684" => "东萨摩亚(美)", "685" => "西萨摩亚", "686" => "基里巴斯", "687" => "新喀里多尼亚群岛(法)", "688" => "图瓦卢", "689" => "法属波里尼西亚", "852" => "香港(中国)", "853" => "澳门(中国)", "855" => "柬埔寨", "856" => "老挝", "880" => "孟加拉国", "886" => "台湾(中国)", "960" => "马尔代夫", "961" => "黎巴嫩", "962" => "约旦", "963" => "叙利亚", "964" => "伊拉克", "965" => "科威特", "966" => "沙特阿拉伯", "967" => "也门", "968" => "阿曼", "971" => "阿拉伯联合酋长国", "972" => "以色列", "973" => "巴林", "974" => "卡塔尔", "975" => "不丹", "976" => "蒙古", "977" => "尼泊尔", "992" => "塔吉克斯坦", "993" => "土库曼斯坦", "994" => "阿塞拜疆", "995" => "格鲁吉亚", "996" => "吉尔吉斯斯坦", "998" => "乌兹别克斯坦", "1242" => "巴哈马", "1246" => "巴巴多斯", "1264" => "安圭拉岛", "1268" => "安提瓜和巴布达", "1345" => "开曼群岛(英)", "1441" => "百慕大群岛(英)", "1649" => "特克斯和凯科斯群岛", "1664" => "蒙特塞拉特岛(英)", "1758" => "圣卢西亚", "1767" => "多米尼加联邦", "1784" => "圣文森特岛(英)", "1787" => "波多黎各(美)", "1809" => "特立尼达和多巴哥", "1869" => "圣克里斯托弗和尼维斯", "1876" => "牙买加", "1890" => "多米尼加共和国"];

// 定义热门的code
$hotCodes = ['86', '852', '853', '886', '81', '65', '66'];

// 先转出拼音
$pinyin = new Pinyin();
$pyArr = [];
foreach ($lang['cn'] as $code => $label) {
    $pyArr[] = [
        'label' => $label,
        'value' => $code,
        'py' => $pinyin->phrase($label, '-')
    ];
}
// 按照拼音排序
array_multisort(array_column($pyArr, 'py'), SORT_ASC, $pyArr);
// 转成新的数组
$arr = [];
$arr['#'] = [];
foreach ($pyArr as $item) {
    if (in_array($item['value'], $hotCodes)) {
        $arr['#'][] = [
            'label' => $item['label'],
            'value' => $item['value'],
        ];
    }
    $letter = strtoupper(substr($item['py'], 0, 1));
    if (!isset($arr[$letter])) {
        $arr[$letter] = [];
    }
    $arr[$letter][] = [
        'label' => $item['label'],
        'value' => $item['value'],
    ];
}
file_put_contents('./dist/lang-cn.json', json_encode($arr, JSON_UNESCAPED_UNICODE));